Revit 2024 API
FabricationItemFolder.GetSubFolders Method
 Gets the item folder's sub folders.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public IList<FabricationItemFolder> GetSubFolders()
Visual Basic
Public Function GetSubFolders As IList(Of FabricationItemFolder)
Visual C++
public:
IList<FabricationItemFolder^>^ GetSubFolders()
See Also
FabricationItemFolder Class
Autodesk.Revit.DB Namespace